from random import choice

def main():
    deck = create_deck()
    get_dek_user(deck_full=deck)



def get_dek_user(deck_full):


    amount_deck = int(input("Введиет количество карт в колоде: "))

    for line in range(amount_deck):
        k, v = deck_full.popitem()

        print(k, v)

def create_deck():
    # 6 7 8 9 10 в д к т # Буби Черви Пики Крести
    deck = {"Буби 6":"6","Черви 6":"6", "Пики 6":"6", "Крести 6":"6",
            "Буби 7":"7","Черви 7":"7", "Пики 7":"7", "Крести 7":"7",
            "Буби 8":"8","Черви 8":"8", "Пики 8":"8", "Крести 8":"8",
            "Буби 9":"9","Черви 9":"6", "Пики 9":"9", "Крести 9":"9",
            "Буби 10":"10","Черви 10":"10", "Пики 10":"10", "Крести 10":"10",
            "Буби валет":"11","Черви валет":"11", "Пики валет":"11", "Крести валет":"11",
            "Буби дама":"12","Черви дама":"12", "Пики дама":"12", "Крести дама":"12",
            "Буби король":"13","Черви король":"13", "Пики король":"13", "Крести король":"13",
            "Буби туз":"14","Черви туз":"14", "Пики туз":"14", "Крести туз":"14"}

    return deck
main()